<h2>Основные темы семинара</h2>

<table>
    <tbody>
        <tr>
            <td class="nowrap"><a href="/fall2013">Осенний&nbsp;семестр&nbsp;2013&mdash;2014</a></td>
            <td>Логические основы формальной семантики, основные семантические концепции интенсиональной логики
            (Фреге, Рассел, Айдукевич, Карнап, Крипке, Чёрч, Монтегю)</td>
        </tr>
        <tr>
            <td class="nowrap"><a href="/spring2014">Весенний&nbsp;семестр&nbsp;2013&mdash;2014</a></td>
            <td>Основные конструкции формальной семантики (универсальная грамматика Монтегю и PTQ Framework,
            теория репрезентации дискурса, динамическая логика предикатов, теоретико-игровая семантика),
            формализация принципа композициональности на основе лямбда-исчисления, унификации графовых структур,
            общей топологии и теории пучков</td>
        </tr>
        <tr>
            <td class="nowrap"><a href="/fall2014">Осенний&nbsp;семестр&nbsp;2014&mdash;2015</a></td>
            <td>Когнитивная семантика, когнитивные архитектуры и концептуальное моделированиe (теория образов
            Гренандера, концептуальные пространства Гэрденфорса, распределенные структурные представления,
            Gradient Symbol Processing и др.)</td>
        </tr>
        <tr>
            <td class="nowrap"><a href="/spring2015">Весенний&nbsp;семестр&nbsp;2014&mdash;2015</a></td>
            <td>Дистрибутивная семантика и композициональные дистрибутивные семантические модели</td>
        </tr>
        <tr>
            <td class="nowrap"><a href="/fall2015">Осенний&nbsp;семестр&nbsp;2015&mdash;2016</a></td>
            <td>Вычислительные аспекты динамической семантики (динамическая логика предикатов и логика предикатов
            с анафорой, эпистемическая динамическая логика и логика публичных анонсов, обобщённые и разветвлённые
            кванторы, Update Semantics, Minimal Recursion Semantics, линейная логика в Glue Semantics, модели
            параллельных и распределенных вычислений в семантике: сети Петри, мю-исчисление, размеченные системы
            переходов и теория пучков)</td>
        </tr>
        <tr>
            <td class="nowrap">Весенний&nbsp;семестр&nbsp;2015&mdash;2016</td>
            <td>Теоретико-типовая лексическая семантика</td>
        </tr>
    </tbody>
</table>